In [1]:
import numpy as np
import pandas as pd
#For working with csv-comma separated values we use pandas

In [2]:
a=np.linspace(1,10,10)
print(a)

[ 1.  2.  3.  4.  5.  6.  7.  8.  9. 10.]

In [4]:
print(a.dtype)

float64

In [6]:
#Series and Dataframes are classes
ser=pd.Series(a)
print(ser)

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [16]:
data={
    "empid":[1001,1002,1003,1004,1005,1006],
    "empname":["A","B","C","D","E","F"],
    "salary":[80000.0,55000.0,50000.0,40000.0,35000.0,10000.0]
}
df=pd.DataFrame(data)
df

   empid empname   salary
0   1001       A  80000.0
1   1002       B  55000.0
2   1003       C  50000.0
3   1004       D  40000.0
4   1005       E  35000.0
5   1006       F  10000.0

In [17]:
#use of shape=df.shape:returns number of rows nd columns
df.shape

(6, 3)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   empid    6 non-null      int64
 1   empname  6 non-null      object
 2   salary   6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

In [20]:
#Write dataframe into .csv file
df.to_csv("emp.csv",index=None)
print("Data is saved successfully")

Data is saved successfully

In [28]:
#Read .csv file using pandas
df2=pd.read_csv("student_info.csv")
df2

     study_hours  student_marks
0           6.83          78.50
1           6.56          76.74
2            NaN          78.68
3           5.67          71.82
4           8.67          84.19
..           ...            ...
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

[200 rows x 2 columns]

In [29]:
df2.shape

(200, 2)

In [35]:
df2.tail(2)

     study_hours  student_marks
198         6.60          78.05
199         8.35          83.50

In [34]:
df2.head(2)

   study_hours  student_marks
0         6.83          78.50
1         6.56          76.74

In [39]:
#Describe function:
df2.describe()

       study_hours  student_marks
count   195.000000      200.00000
mean      6.995949       77.93375
std       1.253060        4.92570
min       5.010000       68.57000
25%       5.775000       73.38500
50%       7.120000       77.71000
75%       8.085000       82.32000
max       8.990000       86.99000